cases/chpt4-forces-MarN/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19900;
    }
    wallTube
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       20000;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          10000;
        startFace       20100;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          10000;
        startFace       30100;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       40100;
    }
)

// ************************************************************************* //
